---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ParameterFailures.UnrecognizedSharedParameterDataType
source: html/2b499ee5-332c-d077-dfd4-1d4578ce3401.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ParameterFailures.UnrecognizedSharedParameterDataType Property

The shared parameter '...' with name '...' cannot be added because its data type is not recognized.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnrecognizedSharedParameterDataType { get; }
```